cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1230E6PM.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="WATCHDOG0">
      <name>WATCHDOG1</name>
      <prependToName>WATCHDOG1</prependToName>
      <baseAddress>0x40001000</baseAddress>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>Register map for GPIOA peripheral</description>
      <groupName>GPIO</groupName>
      <prependToName>GPIOA</prependToName>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>GPIOA</name><value>0</value></interrupt>
      <registers>
        <register>
          <name>DATA</name>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
        </register>
        <register>
          <name>DIR</name>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
        </register>
        <register>
          <name>IS</name>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
        </register>
        <register>
          <name>IBE</name>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
        </register>
        <register>
          <name>IEV</name>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
        </register>
        <register>
          <name>IM</name>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>GPIO_IM_GPIO</name>
              <description>GPIO Interrupt Mask Enable</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>GPIO_RIS_GPIO</name>
              <description>GPIO Interrupt Raw Status</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>GPIO_MIS_GPIO</name>
              <description>GPIO Masked Interrupt Status</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>GPIO_ICR_GPIO</name>
              <description>GPIO Interrupt Clear</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSEL</name>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
        </register>
        <register>
          <name>DR2R</name>
          <description>GPIO 2-mA Drive Select</description>
          <addressOffset>0x00000500</addressOffset>
        </register>
        <register>
          <name>DR4R</name>
          <description>GPIO 4-mA Drive Select</description>
          <addressOffset>0x00000504</addressOffset>
        </register>
        <register>
          <name>DR8R</name>
          <description>GPIO 8-mA Drive Select</description>
          <addressOffset>0x00000508</addressOffset>
        </register>
        <register>
          <name>ODR</name>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
        </register>
        <register>
          <name>PUR</name>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
        </register>
        <register>
          <name>PDR</name>
          <description>GPIO Pull-Down Select</description>
          <addressOffset>0x00000514</addressOffset>
        </register>
        <register>
          <name>SLR</name>
          <description>GPIO Slew Rate Control Select</description>
          <addressOffset>0x00000518</addressOffset>
        </register>
        <register>
          <name>DEN</name>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
        </register>
        <register>
          <name>LOCK</name>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <fields>
            <field>
              <name>GPIO_LOCK</name>
              <description>GPIO Lock</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_LOCK_UNLOCKED</name>
                  <description>The GPIOCR register is unlocked and may be modified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_LOCKED</name>
                  <description>The GPIOCR register is locked and may not be modified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_LOCK_KEY</name>
                  <description>Unlocks the GPIO_CR register</description>
                  <value>0x4c4f434b</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>AMSEL</name>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000528</addressOffset>
        </register>
        <register>
          <name>PCTL</name>
          <description>GPIO Port Control</description>
          <addressOffset>0x0000052C</addressOffset>
        </register>
        <register>
          <name>ADCCTL</name>
          <description>GPIO ADC Control</description>
          <addressOffset>0x00000530</addressOffset>
        </register>
        <register>
          <name>DMACTL</name>
          <description>GPIO DMA Control</description>
          <addressOffset>0x00000534</addressOffset>
        </register>
